# GetDashFromPseudoInd

## Description
Gets the dash style that corresponds to the pseudo index and returns the style's internal index. Returns TRUE if successful.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION GetDashFromPseudoInd(
				pseudoIndex      : INTEGER;
				VAR outDashStyle : LONGINT) : BOOLEAN;
```

```python

def vs.GetDashFromPseudoInd(pseudoIndex):
    return (BOOLEAN, outDashStyle)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pseudoIndex|INTEGER|Pseudo index (negative value)  for which a dash style is requested. |
|outDashStyle|LONGINT|Negative internal index of a dashed line type corresponding to the pseudo index.|

## See Also
VS Functions:
GetPseudoIndFromDash| BeginMultDashConvert| EndMultDashConvert

## Version
Availability: from Vectorworks 2019
## Category
* Utility